app/views/users/show.html.erb

SELECT  1 AS one FROM "dogs" WHERE "dogs"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
<h1><%=@user.name%></h1>
    <% if @user.dogs.any? %>

SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]
---
    <% end %>
  <h3>Reservations: (<%= @user.reservations.count %>)</h3>