app/controllers/dogs_controller.rb

  def create
    @dog = current_user.dogs.build(dog_params)
    if @dog.save
---
INSERT INTO "dogs" ("user_id", "name", "breed", "gender", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["name", "DeeDee"], ["breed", "Golden Retriever"], ["gender", "Female"], ["age", 8], ["created_at", "2018-04-12 14:28:55.900248"], ["updated_at", "2018-04-12 14:28:55.900248"]]