app/controllers/emp_sessions_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "13doctor@outlook.com"], ["LIMIT", 1]]
---
  def create
    puts "in create"
    employee = Employee.find_by(email: params[:emp_sessions][:email].downcase)