app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "email", "password_digest", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(emp_params)
    if(@employee.admin != true)
      @employee.admin = false
    end
    if @employee.save