app/controllers/reservations_controller.rb

  def new
    @reservations = Reservation.all
    @kennels = Kennel.all
---
SELECT "reservations".* FROM "reservations"
SELECT "kennels".* FROM "kennels"

  def create
    @reservation = current_user.reservations.build(r_params)
    @reservation.status = "booked"
    if(@reservation.report != true)
      @reservation.report = "false"
    end
    if @reservation.save
---
INSERT INTO "reservations" ("user_id", "dog_id", "kennel_id", "startdate", "enddate", "status", "report", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)