app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @dogs = @user.dogs.paginate(page: params[:page])
    @reservations = @user.reservations.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "dogs" WHERE "dogs"."user_id" = ?  [["user_id", 1]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]